//1. Задать температуру в градусах по Цельсию. Вывести в alert соответствующую температуру в градусах по Фаренгейту. 
//Подсказка: расчёт идёт по формуле: Tf = (9 / 5) * Tc + 32, где Tf – температура по Фаренгейту, Tc – температура по Цельсию
var Tc = +prompt('Введите температуру в градусах по цельсию');
var Tf = (9 / 5) * Tc + 32;
alert('Температура в градусах по Фарингейту ' + Tf);

//2. Работа с переменными. Сделать обмен значений двух числовых переменных без использования третьей переменной. 
//Например, x = 10, y = 20 После преобразования должно стать так: x = 20, y = 10
