alert('Поивет из внешнего файла');

//var name = prompt('Введите ваше имя'); 
//alert('Привет, ' + name);
//document.write('<h1>Добрый день, ' + name + '</h1>');
//console.log(document);

//Типы данных
//var a = 10;
//var b = a / 0; //Получим бесконечность 
//var b = 2 + "3"; //Получим 23
//var b = 2 * "3"; //Получим 6, так как динамическая строка будет преобразована в тип number
//console.log(b);

//var currentAge = +prompt("Ваш возраст");//Если убрать +, то цифры будут восприниматься, как текст, а плюс преобразовывает строку в число. Вместо него можно поставить parseInt
//parseInt для целого типа, если вводить вещественные числа, надо использовать parseFloat
//var nextAge = currentAge + 2;
//alert(nextAge);

//var a = 10 % 3;// = 1
//alert(a);

//var year = +prompt('Введите год');
//alert(year % 4 == 0);//true false

//Логические операции

//alert(2 === "2");
